cr1901/msp430g2xx/svds/msp430g2x53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMPARATOR_A</name>
      <description>Comparator A</description>
      <baseAddress>88</baseAddress>
      <registers>
        <register>
          <name>CACTL1</name>
          <description>Comparator A Control 1</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CAIFG</name>
              <description>Comp. A Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAIE</name>
              <description>Comp. A Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAIES</name>
              <description>Comp. A Int. Edge Select: 0:rising / 1:falling</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAON</name>
              <description>Comp. A enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAREF</name>
              <description>Comp. A Internal Reference Select 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAREF_0</name>
                  <description>Comp. A Int. Ref. Select 0 : Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAREF_1</name>
                  <description>Comp. A Int. Ref. Select 1 : 0.25*Vcc</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAREF_2</name>
                  <description>Comp. A Int. Ref. Select 2 : 0.5*Vcc</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAREF_3</name>
                  <description>Comp. A Int. Ref. Select 3 : Vt</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CARSEL</name>
              <description>Comp. A Internal Reference Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAEX</name>
              <description>Comp. A Exchange Inputs</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACTL2</name>
          <description>Comparator A Control 2</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>CAOUT</name>
              <description>Comp. A Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAF</name>
              <description>Comp. A Enable Output Filter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CASHORT</name>
              <description>Comp. A Short + and - Terminals</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2CA</name>
              <description>Comp. A +Terminal Multiplexer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>P2CA</name>
                <enumeratedValue>
                  <name>NONE_NONE</name>
                  <description>No + or - connection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA0_NONE</name>
                  <description>Connect + to CA0, no connection to -</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE_CA1</name>
                  <description>No connection to +, connect - to CA1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA0_CA1</name>
                  <description>Connect + to CA0, connect - to CA1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE_CA2</name>
                  <description>No connection to +, connect - to CA2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA0_CA2</name>
                  <description>Connect + to CA0, connect - to CA2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE_CA3</name>
                  <description>No connection to +, connect - to CA3</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA0_CA3</name>
                  <description>Connect + to CA0, connect - to CA3</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE_CA4</name>
                  <description>No connection to +, connect - to CA4</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA0_CA4</name>
                  <description>Connect + to CA0, connect - to CA4</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE_CA5</name>
                  <description>No connection to +, connect - to CA5</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA0_CA5</name>
                  <description>Connect + to CA0, connect - to CA5</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE_CA6</name>
                  <description>No connection to +, connect - to CA6</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA0_CA6</name>
                  <description>Connect + to CA0, connect - to CA6</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE_CA7</name>
                  <description>No connection to +, connect - to CA7</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA0_CA7</name>
                  <description>Connect + to CA0, connect - to CA7</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA1_NONE</name>
                  <description>Connect + to CA1, no connection to -</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA2_NONE</name>
                  <description>Connect + to CA2, no connection to -</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA1_CA1</name>
                  <description>Connect + to CA1, connect - to CA1</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA2_CA1</name>
                  <description>Connect + to CA2, connect - to CA1</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA1_CA2</name>
                  <description>Connect + to CA1, connect - to CA2</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA2_CA2</name>
                  <description>Connect + to CA2, connect - to CA2</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA1_CA3</name>
                  <description>Connect + to CA1, connect - to CA3</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA2_CA3</name>
                  <description>Connect + to CA2, connect - to CA3</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA1_CA4</name>
                  <description>Connect + to CA1, connect - to CA4</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA2_CA4</name>
                  <description>Connect + to CA2, connect - to CA4</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA1_CA5</name>
                  <description>Connect + to CA1, connect - to CA5</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA2_CA5</name>
                  <description>Connect + to CA2, connect - to CA5</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA1_CA6</name>
                  <description>Connect + to CA1, connect - to CA6</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA2_CA6</name>
                  <description>Connect + to CA2, connect - to CA6</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA1_CA7</name>
                  <description>Connect + to CA1, connect - to CA7</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA2_CA7</name>
                  <description>Connect + to CA2, connect - to CA7</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPD</name>
          <description>Comparator A Port Disable</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>CAPD0</name>
              <description>Comp. A Disable Input Buffer of Port Register .0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD1</name>
              <description>Comp. A Disable Input Buffer of Port Register .1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD2</name>
              <description>Comp. A Disable Input Buffer of Port Register .2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD3</name>
              <description>Comp. A Disable Input Buffer of Port Register .3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD4</name>
              <description>Comp. A Disable Input Buffer of Port Register .4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD5</name>
              <description>Comp. A Disable Input Buffer of Port Register .5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD6</name>
              <description>Comp. A Disable Input Buffer of Port Register .6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD7</name>
              <description>Comp. A Disable Input Buffer of Port Register .7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD</name>
              <description>Comparator A Port Disable register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
