cr1901/msp430g2xx/svds/msp430g2x53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USCI_B0_SPI_MODE</name>
      <description>USCI_B0  SPI Mode</description>
      <baseAddress>104</baseAddress>
      <registers>
        <register>
          <name>UCB0CTL0</name>
          <description>USCI B0 Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCSYNC</name>
              <description>Sync-Mode  0:UART-Mode / 1:SPI-Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCMODE</name>
              <description>Sync. Mode: USCI Mode 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCMODE_0</name>
                  <description>Sync. Mode: USCI Mode: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_1</name>
                  <description>Sync. Mode: USCI Mode: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_2</name>
                  <description>Sync. Mode: USCI Mode: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCMODE_3</name>
                  <description>Sync. Mode: USCI Mode: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCMST</name>
              <description>Sync. Mode: Master Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UC7BIT</name>
              <description>Sync. Mode: Data Bits 0:8-bits / 1:7-bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCMSB</name>
              <description>Sync. Mode: MSB first 0:LSB / 1:MSB</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCCKPL</name>
              <description>Sync. Mode: Clock Polarity</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCCKPH</name>
              <description>Sync. Mode: Clock Phase</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0CTL1</name>
          <description>USCI B0 Control Register 1</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCSWRST</name>
              <description>USCI Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCSSEL</name>
              <description>USCI 1 Clock Source Select 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCSSEL_0</name>
                  <description>USCI 0 Clock Source: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_1</name>
                  <description>USCI 0 Clock Source: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_2</name>
                  <description>USCI 0 Clock Source: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCSSEL_3</name>
                  <description>USCI 0 Clock Source: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0BR0</name>
          <description>USCI B0 Baud Rate 0</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCB0BR0</name>
              <description>USCI B0 Baud Rate 0 register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0BR1</name>
          <description>USCI B0 Baud Rate 1</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCB0BR1</name>
              <description>USCI B0 Baud Rate 1 register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0STAT</name>
          <description>USCI B0 Status Register</description>
          <addressOffset>5</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCBUSY</name>
              <description>USCI Busy Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCOE</name>
              <description>USCI Overrun Error Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCFE</name>
              <description>USCI Frame Error Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>USCI Listen mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0RXBUF</name>
          <description>USCI B0 Receive Buffer</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCB0RXBUF</name>
              <description>USCI B0 Receive Buffer register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0TXBUF</name>
          <description>USCI B0 Transmit Buffer</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCB0TXBUF</name>
              <description>USCI B0 Transmit Buffer register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
